<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b71c25197cafefb313cad499c849acb29e2b32fe044d9b1623fb5c72757176bb","plan_job_ref":"Job Terraform Plan #5 at https://github.com/cal-itp/gtfs.calitp.org/actions/runs/15426439123","plan_out_hash":"a14ef0ee31ce42e0a34ab36f785619a40e2d829783d1949a3471d883fecb14b7","plan_hash":"32316c213a623a7967ac797e4424604be9e3469f91aba98462896a64cbc67290","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.gtfs-calitp-org["index.html"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "wLft4Q==" -> (known after apply)
!~      detect_md5hash      = "mm+81FgqxfrHm68cI1LpXw==" -> "different hash"
!~      generation          = 1745867931811171 -> (known after apply)
        id                  = "calitp-gtfs-index.html"
!~      md5hash             = "mm+81FgqxfrHm68cI1LpXw==" -> (known after apply)
        name                = "index.html"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.gtfs-calitp-org["sha.txt"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "m6CLUA==" -> (known after apply)
!~      detect_md5hash      = "7N4H86vj+OlymKLsIFuIhQ==" -> "different hash"
!~      generation          = 1745867931802670 -> (known after apply)
        id                  = "calitp-gtfs-sha.txt"
!~      md5hash             = "7N4H86vj+OlymKLsIFuIhQ==" -> (known after apply)
        name                = "sha.txt"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #5](https://github.com/cal-itp/gtfs.calitp.org/actions/runs/15426439123)